1. Дополните приведенный код, используя списочное выражение так, чтобы получить новый список, содержащий строки исходного списка, где у каждой строки удалён первый символ.

keywords = ['False', 'True', 'None', 'and', 'with', 'as', 'assert', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'try', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'while', 'yield']

new_keywords = [i[1:] for i in keywords]

print(new_keywords)

#####


2. Дополните приведенный код, используя списочное выражение, так чтобы получить новый список, содержащий длины строк исходного списка.

keywords = ['False', 'True', 'None', 'and', 'with', 'as', 'assert', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'try', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'while', 'yield']

lengths = [len(i) for i in keywords]

print(lengths)

#####


3. Дополните приведенный код списочным выражением, чтобы получить новый список, содержащий только слова длиной не менее пяти символов (включительно).

keywords = ['False', 'True', 'None', 'and', 'with', 'as', 'assert', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'try', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'while', 'yield']

new_keywords = [i for i in keywords if len(i) >= 5]

print(new_keywords)

#####


4. На вход программе подается натуральное число n. Напишите программу, использующую списочное выражение, которая создает список, содержащий квадраты чисел от 1 до n (включительно), а затем выводит его элементы построчно, то есть каждый на отдельной строке.
__________
Формат входных данных
На вход программе подается натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
__________
Примечание. Для вывода элементов списка используйте цикл for.
__________
Пример ввода:
5

Пример вывода:
1
4
9
16
25
__________
print(*[i ** 2 for i in range(1, int(input()) + 1)], sep='\n')

#####


5. На вход программе подается строка текста, содержащая целые числа. Напишите программу, использующую списочное выражение, которая выведет кубы указанных чисел также на одной строке.
__________
Формат входных данных
На вход программе подается строка текста, содержащая целые числа, разделенные символом пробела.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
__________
Примечание 1. Для вывода элементов списка используйте цикл for.

Примечание 2. Используйте метод split().
__________

Пример ввода 1:
2 4 3

Пример вывода 1:
8 64 27

Пример ввода 2:
-2 -5 0

Пример вывода 2:
-8 -125 0
__________
seq = [int(el) for el in input().split()]
cubes = [el ** 3 for el in seq]

for el in cubes:
    print(el, end=" ")
